//TODO: 1 ===================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// const a = 10;
// перший варіант if else

// let message;

// if (a === 10) {
//     message = "Вірно";
// } else {
//     message = "Не вірно";
// }

// другий варіант тернарний

// const message = a === 10 ? "Вірно" : "Не вірно";

// console.log(message);

//TODO: 2 ===================================
// У змінній min лежить число від 0 до 60. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).

// const min = -10;
// let message;

// if (min >= 0 && min <= 15) {
//     message = "Перша частина 0-15";
// } else if (min > 15 && min <= 30) {
//     message = "Друга частина 15-30";
// } else if (min > 30 && min <= 45) {
//     message = "Третя частина 30-45";
// } else if (min > 45 && min <= 60) {
//     message = "Четверта частина 45-60";
// } else {
//     message = "Error";
// }

// console.log(message);

//TODO: 3 ===================================
// Змінна num може набувати 4 значення: 1, 2, 3 або 4. Якщо вона має
// значення '1', то у змінну result запишемо 'зима', якщо має значення
// '2' - 'весна' і так далі. Розв'яжіть завдання через switch-case.

// const num = 2;
// let message;

// switch (num) {
//     case 1:
//         message = "Зима";
//         break;

//     case 2:
//         message = "Весна";
//         break;

//     case 3:
//         message = "Літо";
//         break;

//     case 4:
//         message = "Осінь";
//         break;

//     default:
//         message = "Error";
//         break;
// }

// console.log(message);

// TODO: 4 ===================================
// скористаємося циклом while та виведіть у консоль числа від 0 до 50

// let counter = 0;

// while (counter <= 50) {
//   console.log(counter);
//   counter += 1;
// }

//TODO: 5 ===================================
//Використовуючи конструкцію if...else,
//напишіть код, який запитуватиме:
//"Яка офіційна назва JavaScript?"
//Якщо користувач вводить "ECMAScript",
// показати через alert: "Вірно!"
//інакше відобразити: "Не знаєте? ECMAScript!"

// const question = prompt("Яка «офіційна» назва JavaScript?").toLowerCase();

// if (question === "ecmascript") {
//   alert("Вірно!");
// } else {
//   alert("Не знаєте? ECMAScript!");
// }

//TODO: 6 ===================================
// Напишіть програму, яка отримає від користувача
//число (кількість хвилин) і виведе у консоль
//рядок у форматі годин і хвилин
//70 === 01:10
// https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/padStart

// const globalMinutes = 70;
// const minutes = String(globalMinutes % 60).padStart(2, 0);
// const hours = String(Math.floor(globalMinutes / 60)).padStart(2, 0);
// console.log(`${hours}:${minutes}`);
// console.log(minutes);
// console.log(hours);

//TODO: 7 ===================================
//Напишіть цикл, який виводить у консоль
// числа від max до min за спаданням
// Додайте усі парні числа від min до max
// let total = 0;
// const min = 0;
// const max = 10;
// for (let i = max; i >= min; i -= 1 ) {
// if (i % 2 !== 0) {
//  continue
// } 
// console.log("Парні:", i); 
// total += i;
// }
// console.log(total); 




//TODO: 8 ===================================
//Напишіть код, який запитуватиме
//логін за допомогою prompt і логувати результат
//в консоль браузера
//Якщо відвідувач вводить "Адмін",
//то prompt запитує пароль.
//Якщо нічого не ввели або натиснута клавіша відміна
//Вивести рядок "Я вас не знаю"
//Пароль перевіряти так:
//Якщо введено пароль "Я головний",
//то вивести рядок "Добрий день!"
// Якщо відвідувач натиснув відміна виводити рядок 'скасовано'
//інакше виводити рядок "Невірний пароль!"

// const loginInput = prompt('Введіть свій логін');
// if (loginInput === "Адмін" ) {
//  const password = prompt("введіть пароль");
//  if (password) {
// if (password === "Я головний") {
// alert("Добрий день!")
// } else {
//     alert("Невірний пароль!")
// }
//  } else {
//     alert("Скасовано")
//  }
// } else {
//     alert("Я вас не знаю")
// }





//TODO: 9 ===================================
// При завантаженні сторінки користувачеві пропонується
// в prompt ввести число. Введення додається до значення
// змінної total.
// Операція введення числа триває до того часу,
// поки користувач не натисне кнопку Cancel в prompt.
// Після того, як користувач припинив введення натиснувши на
// кнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку,що користувач ввів саме число,
// а не довільний набір символів, не потрібно.

// let total = 0;
// let quastion;
// do {
//     quastion = prompt("Введіть число") 
//     if (quastion === null) {
// break
//     } 
//     total += Number(quastion);
// } while (true);
// alert(total)


//TODO: 10 ===================================
// Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо відвідувач ввів інше число - попросити
// ввести ще раз і так далі.
// Цикл має питати число, поки відвідувач не
// введе число більше 100, або натисне кнопку
// скасування в prompt

//TODO: 11 ===================================
//Даний рядок, що складається із символів, наприклад, 'abcde'.
// Перевірте, що першим символом цього рядка є буква 'a'.
// Якщо це так - виведіть 'так', інакше виведіть 'ні'.

// const str = 'abcde';
// str.startsWith("a") ? console.log("так") : console.log("ні");



//TODO: 12 ===================================
//Якщо число ділитися на 3 повертати
//fizz якщо ділитися на 5 повертати buzz
//Якщо ділитися на 3 і на 5 повернути fizzbuzz

// let number = 20;
// for (let i = 1; i <= number; i += 1 ) {
//  let str = "";
//  if (i % 3 === 0) {
//     str += "fizz"
//  }
//  if (i % 5 === 0) {
//     str += "buzz"
//  }
//  console.log(str || i);
// }


//TODO: 13 ===================================
// Напишіть if..else, що відповідає наступному switch:

// const browser = 'Opera';

// switch (browser) {
//   case 'Edge':
//     alert("You've got the Edge!");
//     break;

//   case 'Chrome':
//   case 'Firefox':
//   case 'Safari':
//   case 'Opera':
//     alert('Okay we support these browsers too');
//     break;

//   default:
//     alert('We hope that this page looks ok!');
// }
